{
    "1": {
        "meaning": "a number which is only approximate, but quite close to the correct number.",
        "examples": ["Please get me the ballpark figure for the cost of the renovation."],
        "title": "ballpark figure"
    },
    "2": {
        "meaning": "used to convey that you cannot understand something that is written or said.",
        "examples": ["I tried reading that science journal, but it was all Greek to me."],
        "title": "it's all Greek to me"
    },
    "3": {
        "meaning": "full of big talk but lacking action, power, or substance; pretentious.",
        "examples": ["He has these grand plans of being an entrepreneur and owning a big business, but he never takes any action. Guess he is all bark and no bite."],
        "title": "all bark and no bite"
    },
    "4": {
        "meaning": "it's better to be content with what you have than to risk losing everything by seeking to get more.",
        "examples": ["If I were you I'd accept the offer rather than waiting for a better one. After all, a bird in the hand is worth two in the bush."],
        "title": "a bird in the hand (is worth two in the bush)"
    },
    "5": {
        "meaning": "a completely different situation, often one which is difficult or which you know very little about.",
        "examples": ["We'd done a lot of climbing in Scotland, but the Himalayas were a whole new ball game."],
        "title": "a whole new ball game"
    },
    "6": {
        "meaning": "used to convey something that has happened was so strange that one never thought it would happen.",
        "examples": ["Never in my wildest dreams did I imagine that she'd leave me for someone else."],
        "title": "never in the wildest dreams"
    },
    "7": {
        "meaning": "extreme circumstances or situations that can only be resolved by resorting to equally extreme actions.",
        "examples": ["Government actions during the recession are unpopular, but desperate times call for desperate measures."],
        "title": "desperate times call for desperate measures"
    },
    "8": {
        "meaning": "confusing, meaningless, nonsensical language, especially related to a speech or religious ritual.",
        "examples": ["The politician made a right fool of himself with all that mumbo jumbo on the stage.", "It is often people who do not understand the full meaning of religion that end up in such mumbo jumbo."],
        "title": "mumbo jumbo"
    },
    "9": {
        "meaning": "continuing to do something when you have almost no energy left.",
        "examples": ["Have you had any rest? You seem to be running on fumes."],
        "title": "running on fumes"
    },
    "10": {
        "meaning": "if you get information about something from the horse's mouth, you get it from someone who is involved in it and knows a lot about it.",
        "examples": ["I know it's true! I heard it straight from the horse's mouth!"],
        "title": "from the horse's mouth"
    },
    "11": {
        "meaning": "to work very hard, very energetically.",
        "examples": ["She has an important deadline coming up, so she's been working like a beaver."],
        "title": "work like a beaver"
    },
    "12": {
        "meaning": "the time at which a planned operation, typically a military one, is set to begin.",
        "examples": ["as zero hour approached, thirty ships swung into position"],
        "title": "zero hour"
    },
    "13": {
        "meaning": "something of trouble, burden or oppressive to someone.",
        "examples": ["His kids are a yoke around his neck.", "My manager is sometimes a yoke around my neck."],
        "title": "yoke around neck"
    },
    "14": {
        "meaning": "to discuss private or embarrassing matters in public.",
        "examples": ["Listen, our relationship may have real problems, but it's unfortunate that you have chosen to wash our dirty linen in public."],
        "title": "wash dirty linen in public"
    },
    "15": {
        "meaning": "talk about the important point without causing any delays by discussing the preliminaries.",
        "examples": ["After a few introductory comments, we cut to the chase and began negotiating."],
        "title": "cut to the chase"
    },
    "16": {
        "meaning": "to be mean, unfair, insulting or not following the rules.",
        "examples": ["I do not believe in fighting below the belt. The dignity of a fight is lost when people do that."],
        "title": "below the belt"
    },
    "17": {
        "meaning": "a rehearsal of a performance or procedure before the real one.",
        "examples": ["Today is only a dry run so we will not be using the actual costumes."],
        "title": "dry run"
    },
    "18": {
        "meaning": "there's something good even in bad, unpleasant situations.",
        "examples": ["I'm sorry your business is going badly, but don't despair. Every cloud has a silver lining."],
        "title": "every cloud has a silver lining"
    },
    "19": {
        "meaning": "used to emphasize that a person is a physical, living being with human emotions or frailties, often in contrast to something abstract, spiritual, or mechanical.",
        "examples": ["I can't do everything tirelessly like a computer, I'm only flesh and blood"],
        "title": "flesh and blood"
    },
    "20": {
        "meaning": "used to describe a person looking sick or feeling ill or nauseous; may also refer to drool seen before vomiting.",
        "examples": ["You have had so much to eat at the party that you look green about the gills now."],
        "title": "green around the gills"
    },
    "21": {
        "meaning": "Give credit to what is good in a disagreeable or disliked person.",
        "examples": ["I don't like what the new management has done, but give the devil his due, sales has improved"],
        "title": "give the devil his due"
    },
    "22": {
        "meaning": "to be unaware of what is going on around.",
        "examples": ["She works in the office from 9 to 5 with her head in the clouds"],
        "title": "head in the clouds"
    },
    "23": {
        "meaning": "directly at or against one in an aggressive, annoying, provocative manner that is difficult to ignore.",
        "examples": ["\"In your faces, kids\" shouted the footballer to his opponents after having scored his third goal of the match.", "Unable to tolerate his in your face attitude anymore, his boss fired him from the job."],
        "title": "in your face"
    },
    "24": {
        "meaning": "act before the proper or appropriate time.",
        "examples": ["We do not want to jump the gun by making a statement about what caused the explosion before the investigation is completed."],
        "title": "jump the gun"
    },
    "25": {
        "meaning": "an automatic or reflex reaction to something without thinking.",
        "examples": ["It was a typical knee jerk reaction. He said no immediately without considering our proposal."],
        "title": "knee jerk reaction"
    },
    "26": {
        "meaning": "extremely eager or enthusiastic.",
        "examples": ["Little kids are always as keen as mustard to learn new things around them."],
        "title": "keen as mustard"
    },
    "27": {
        "meaning": "decide not to marry someone at the very last moment.",
        "examples": ["Rachel left Barry at the altar on the day of the wedding."],
        "title": "leave at the altar"
    },
    "28": {
        "meaning": "forget past offences or causes of conflict and be reconciled.",
        "examples": ["The two international rivals shook hands and agreed to let bygones be bygones."],
        "title": "let bygones be bygones"
    },
    "29": {
        "meaning": "mischievous or deceitful behaviour.",
        "examples": ["Do not get involved in monkey business over the internet. Cyber Laws are stricter than before."],
        "title": "monkey business"
    },
    "30": {
        "meaning": "not intended to be known publicly or recorded officially",
        "examples": ["This is off the record, but I disagree with the mayor on this matter."],
        "title": "off the record"
    }
}
