{
    "1": {
        "meaning": "accept a gift gladly without inspecting it for defects.",
        "examples": ["It's so refreshing to work with someone who will throw a saddle on a gift horse rather than look it in the mouth."],
        "title": "throw saddle on a gift horse"
    },
    "2": {
        "meaning": "to be ungrateful to someone who gives you something, a gift especially",
        "examples": ["It's so refreshing to work with someone who will throw a saddle on a gift horse rather than look it in the mouth."],
        "title": "look a gift-horse in the mouth"
    },
    "3": {
        "meaning": "to know when you are really done or finished with something",
        "examples": ["Investigator said \"I would let you go when I've scraped all the shit off the shoe\", when the suspect tried to leave the interrogation."],
        "title": "scrape all the shit of the shoe"
    },
    "4": {
        "meaning": "to have just enough money to live on and nothing extra.",
        "examples": ["My father earned very little and there were four kids, so we lived from hand to mouth."],
        "title": "live (from) hand to mouth"
    },
    "5": {
        "meaning": "more than anything else; in a great quantity",
        "examples": ["He leaned over and kissed him goodnight. Then he lay down close by and whispered with a smile, \"I love you to the moon and back.\""],
        "title": "to the moon and back"
    },
    "6": {
        "meaning": "very tidy, neat, and well-organized; in good order.",
        "examples": ["Her desk looks as nice as ninepence.", "The college library is as nice as ninepence."],
        "title": "as nice as ninepence"
    },
    "7": {
        "meaning": "to be very calm and content, even in unnerving situations.",
        "examples": ["The girl was as calm as a toad in the sun during the speech contest."],
        "title": "as calm as a toad in the sun"
    },
    "8": {
        "meaning": "a time very early in the morning; daybreak.",
        "examples": ["It's a long drive, we'll leave at the crack of dawn."],
        "title": "at the crack of dawn"
    },
    "9": {
        "meaning": "all well and active as far as health is concerned.",
        "examples": ["The old man was all alive and kicking even in the nineties"],
        "title": "alive and kicking"
    },
    "10": {
        "meaning": "very quickly or suddenly.",
        "examples": ["She cam back from college, threw her bag on the couch and left before I could say Jack Robinson."],
        "title": "before one can say Jack Robinson"
    },
    "11": {
        "meaning": "having only two very unpleasant choices.",
        "examples": ["For most people a visit to the dentist is the result of a choice between the devil and the deep blue sea - if you go you suffer, and if you don't go you suffer."],
        "title": "between the devil and the deep blue sea"
    },
    "12": {
        "meaning": "to make the wrong choice; to ask the wrong person; to follow the wrong course.",
        "examples": ["If you think I'm the guilty person, you're barking up the wrong tree."],
        "title": "bark up the wrong tree"
    },
    "13": {
        "meaning": "no matter what happens",
        "examples": ["I'll be there tomorrow, come hell or high water."],
        "title": "come hell or high water"
    },
    "14": {
        "meaning": "to pay a great deal of attention to the details of something, especially when you are trying to complete a task.",
        "examples": ["When you are up against Chuck, it is absolutely vital that we dot our i's and cross our t's."],
        "title": "dot the i's and cross the t's"
    },
    "15": {
        "meaning": "almost all that you can imagine of something.",
        "examples": ["Joey orders everything but the kitchen sink when he goes out to dinner, especially if Chandler is paying for it."],
        "title": "everything but the kitchen sink"
    },
    "16": {
        "meaning": "to be ignored by the persons they were intended for.",
        "examples": ["He had already made up his mind, her advice fell on deaf ears."],
        "title": "fall on deaf ears"
    },
    "17": {
        "meaning": "to be in an extremely bad state and becoming worse.",
        "examples": ["After a student committed suicide, the school is going to hell in handbasket."],
        "title": "go to hell in a handbasket"
    },
    "18": {
        "meaning": "to do exactly the right thing; to describe exactly what is causing a situation or problem",
        "examples": ["His speech at the farewell ceremony hit the nail on the head about the company's situation."],
        "title": "hit the nail on the head"
    },
    "19": {
        "meaning": "to be in a favorable position; in total control",
        "examples": ["We held all the aces in the election."],
        "title": "hold all the aces"
    },
    "20": {
        "meaning": "if you could achieve your aims simply by wishing for them, life would be very easy.",
        "examples": ["I wish to go on a trip to Mars, but alas! if wishes were horses, beggars would ride."],
        "title": "if wishes were horses, beggars would ride"
    }
}
