{
    "1": {
        "meaning": "to fall asleep, esp from physical exhaustion or the effects of alcohol or drugs",
        "examples": ["The driver zonked out behind the wheel and ran off the road."],
        "title": "zonk out"
    },
    "2": {
        "meaning": "when a very serious situation arises.",
        "examples": ["I knew you would come and help when the chips were down."],
        "title": "when the chips are down"
    },
    "3": {
        "meaning": "an abrupt and complete reversal of attitude, opinion, or position.",
        "examples": ["After losing the election, he made a very public and dramatic political volte-face from Left to Right."],
        "title": "volte-face"
    },
    "4": {
        "meaning": "in a mysterious or hidden place or state, especially the unknown state of life after death.",
        "examples": ["Mike realized that his father had passed irrevocably beyond the veil."],
        "title": "beyond the veil"
    },
    "5": {
        "meaning": "to befriend, look after, or take care of someone who proves to be traitorous, untrustworthy, deceitful, or ungrateful.",
        "examples": ["I got my friend a good position in my company and all he did is convinced my manger to fire me, that's when I realized I nursed a viper in my bosom."],
        "title": "nurse a viper in one's bosom"
    },
    "6": {
        "meaning": "increase what is at stake or under discussion, especially in a conflict or dispute.",
        "examples": ["Pete upped the ante on that the poker game to $100 per hand."],
        "title": "up the ante"
    },
    "7": {
        "meaning": "use one's common sense.",
        "examples": ["You haven't even switched the thing on. Come on, Jamie, use your loaf!"],
        "title": "use your loaf"
    },
    "8": {
        "meaning": "deal decisively with a difficult or dangerous situation.",
        "examples": ["It's time to take the bull by the horns and get this job done."],
        "title": "take the bull by the horns"
    },
    "9": {
        "meaning": "to be very appropriate for someone",
        "examples": ["This kind of job suits me to a T."],
        "title": "suit someone to a T"
    },
    "10": {
        "meaning": "used to refuse an offer politely, with the implication that one may take it up at a later date.",
        "examples": ["They wanted me to come along for the ride but I took a rain check"],
        "title": "take a rain check"
    },
    "11": {
        "meaning": "to select from among the worst; to choose from what is left over.",
        "examples": ["The worker you sent over was the worst I've ever seen. Send me another—and don't scrape the bottom of the barrel."],
        "title": "scrape the bottom of the barrel"
    },
    "12": {
        "meaning": "to do or say something that causes trouble and makes a lot of people angry or worried",
        "examples": ["Tell them all they've got to work on Saturday. That should set the cat among the pigeons."],
        "title": "put/set the cat among the pigeons"
    },
    "13": {
        "meaning": "a precise resemblance, especially in closely related persons.",
        "examples": ["People have told me that I look like him, act like him, that my kids are the spitting image of him."],
        "title": "spitting image"
    },
    "14": {
        "meaning": "a day that is pleasantly noteworthy or memorable.",
        "examples": ["The day I first set foot in America was a red-letter day for me."],
        "title": "red letter day"
    },
    "15": {
        "meaning": "standard rules of polite or acceptable behavior; code of conduct",
        "examples": ["HR handed over the sheet that listed the Queensberry rules of the company on the first day at work."],
        "title": "the Queensberry rules"
    },
    "16": {
        "meaning": "to do something surprising",
        "examples": ["GRR Martin pulls a rabbit out of the hat at the end of the story."],
        "title": "pull a rabbit out of your hat"
    },
    "17": {
        "meaning": "the newest person in a group",
        "examples": ["I'm just the new kid on the block. I've only been working here for a month."],
        "title": "new kid on the block"
    },
    "18": {
        "meaning": "an extremely short period of time",
        "examples": ["I'll have that ready for you in a New York Minute."],
        "title": "New York minute"
    },
    "19": {
        "meaning": "have no hesitation in stating or dealing with (something), however unpleasant or awkward it is.",
        "examples": ["He made no bones about how bad he thought the food was."],
        "title": "make no bones about"
    },
    "20": {
        "meaning": "do not instigate trouble.; Leave something alone if it might cause trouble.",
        "examples": ["I thought I would ask Jill if she wanted me to pay her back right away, but then I decided to let sleeping dogs lie."],
        "title": "let sleeping dogs lie"
    }
}
