{
    "1": {
        "meaning": "a tiny portion of something",
        "examples": ["I don’t want a jot or tittle of the cake, I want the whole thing."],
        "title": "jot or tittle"
    },
    "2": {
        "meaning": "an unofficial court set up by a group of people",
        "examples": ["Is this a staff meeting or a kangaroo court?"],
        "title": "Kangaroo court"
    },
    "3": {
        "meaning": "try every possible course of action in order to achieve something",
        "examples": ["He left no stone unturned in his search for his natural mother."],
        "title": "leave no stone unturned"
    },
    "4": {
        "meaning": "very little space, cramped quarters",
        "examples": ["There's not enough room to swing a cat in this tent."],
        "title": "no room to swing a cat"
    },
    "5": {
        "meaning": "read or work late into the night",
        "examples": ["I've got to get this report finished by tomorrow so I guess I'll be burning the midnight oil tonight."],
        "title": "burn the midnight oil"
    },
    "6": {
        "meaning": "a small, poor country with a weak or dishonest government",
        "examples": ["People fear that the country will become a banana republic if the economy doesn't pick up."],
        "title": "banana republic"
    },
    "7": {
        "meaning": "to do things in the wrong order",
        "examples": ["If you're starting to write code without thinking out the logic, you're putting the cart before the horse."],
        "title": "put the cart before the horse"
    },
    "8": {
        "meaning": "a twofold blow or setback",
        "examples": ["Increasing taxes and falling prices of grains is a double whammy for poor farmers."],
        "title": "double whammy"
    },
    "9": {
        "meaning": "loss of something that required only a small amount of effort to acquire in the first place",
        "examples": ["I lost 10k at the casino last night, but that's life - easy come, easy go."],
        "title": "easy come, easy go"
    },
    "10": {
        "meaning": "a charitable or helpful person",
        "examples": ["An anonymous good Samaritan rescued a child from the river yesterday, but left the area before he could be thanked."],
        "title": "good Samaritan"
    }
}
